# general
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "ripgrep"
brew "watch"
brew "findutils"
brew "curl"
brew "the_silver_searcher"
brew "stow"
brew "git"
brew "bash"
brew "zsh"
brew "tmux"
brew "fzf"
brew "jq"
brew "neovim"
brew "htop"
brew "ncdu"
brew "tig"
brew "go"
brew "gimme"
brew "python"
brew "openblas" # https://github.com/numpy/numpy/issues/17784#issuecomment-729950525
brew "pyenv"
brew "pyenv-virtualenv"
brew "zlib" # pyenv dependency
brew "pipenv"
brew "node"
brew "npm"
brew "rustup"
brew "java"
brew "loc"
brew "cmatrix"
brew "pandoc"
brew "tldr"
brew "qcachegrind"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "ffmpeg"
brew "exiftool"
brew "gzip"
brew "unzip"

# ledger
brew "ledger"
brew "hledger"

tap "homebrew/cask"
cask "google-chrome"
cask "brave-browser"
cask "firefox"
cask "iterm2"
cask "spotify"
cask "visual-studio-code"
cask "calibre"
cask "1password"
cask "bitwarden"
cask "telegram"
cask "whatsapp"
cask "typora"
cask "vlc"
cask "mactex"
cask "karabiner-elements"
cask "drawio"
cask "istat-menus"
cask "postman"
cask "monitorcontrol"
cask "netnewswire"

tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-cascadia"

tap "homebrew/cask-drivers"
cask "logitech-options"

# emacs
tap "railwaycat/emacsmacport"
brew "railwaycat/emacsmacport/emacs-mac"
brew "imagemagick" # required to show inline images (I think)

# -------
# datadog
# -------

# general tooling
tap "datadog/tap", "git@github.com:DataDog/homebrew-tap.git"
brew "datadog/tap/python@2"
brew "datadog/tap/latest-image"
brew "datadog/tap/latest-chart"
brew "datadog/tap/s22-checker"
brew "datadog/tap/to-prod"
brew "datadog/tap/to-staging"
brew "datadog/tap/kubectl-analyse"
brew "datadog/tap/kubectl-iscale"
brew "datadog/tap/kubectl-multiexec"
brew "datadog/tap/kubectl-template"
cask "datadog/tap/ddtool"
brew "unison" # nbt dependency

# scala/mortar
tap "homebrew/cask-versions"
cask "homebrew/cask-versions/adoptopenjdk8"
brew "scala211"
brew "sbt"

tap "datadog/data-eng-tools", "git@github.com:DataDog/data-eng-tools.git"
brew "data-eng-tools"

brew "mysql"
brew "postgresql@9.6"
brew "openssl"

brew "gnupg"
brew "make"
brew "pre-commit"
brew "bazelisk"

brew "tfenv"
brew "awscli@1"
brew "azure-cli"
brew "vault"
cask "google-cloud-sdk"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "stern"
brew "rbenv"
brew "black"
cask "aws-vault"

# agenda
brew "just"

# web-ui
brew "yarn"
brew "nodenv"

# dogbox
cask "virtualbox"
cask "vagrant"

brew "saml2aws"
