# coreutils
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "watch"
brew "findutils"

# shells
brew "bash"
brew "zsh"

# search
brew "ripgrep"
brew "the_silver_searcher"

# random cli utils
brew "htop"
brew "ncdu"
brew "loc"
brew "tree"
brew "jq"

# compression
brew "gzip"
brew "unzip"
brew "lz4"

# git
brew "git"
brew "tig"

# curl or similar
brew "curl"
brew "wget"

# emacs
tap "railwaycat/emacsmacport"
brew "railwaycat/emacsmacport/emacs-mac"
brew "imagemagick" # required by emacs

# ledger
brew "ledger"
brew "hledger"

# video encoding
cask "handbrake"
brew "ffmpeg"

# python
brew "python"
brew "openblas" # https://github.com/numpy/numpy/issues/17784#issuecomment-729950525
brew "pyenv"
brew "pyenv-virtualenv"
brew "zlib" # pyenv dependency
brew "pipenv"
brew "pipx"

# node
brew "node"
brew "npm"

# go
brew "go"
brew "gimme"

brew "stow"
brew "tmux"
brew "fzf"
brew "neovim"
brew "rustup"
brew "cmatrix"
brew "pandoc"
brew "tldr"
brew "qcachegrind"
brew "youtube-dl"
brew "exiftool"
brew "d2"
brew "flyctl"

tap "homebrew/cask"
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "visual-studio-code"
cask "calibre"
cask "telegram"
cask "whatsapp"
cask "vlc"
cask "mactex"
cask "dash"
cask "transmission"
cask "musicbrainz-picard"
cask "istat-menus"
cask "bartender"
cask "postman"
cask "monitorcontrol"
cask "netnewswire"

tap "homebrew/cask-versions"

tap "homebrew/cask-fonts"
cask "font-fira-code"

tap "homebrew/cask-drivers"
cask "logitech-options"

# -------
# datadog
# -------

# general tooling
tap "datadog/tap", "git@github.com:DataDog/homebrew-tap.git"
# brew "datadog/tap/python@2"
brew "datadog/tap/latest-image"
brew "datadog/tap/latest-chart"
brew "datadog/tap/s22-checker"
brew "datadog/tap/to-prod"
brew "datadog/tap/to-staging"
brew "datadog/tap/kubectl-analyse"
brew "datadog/tap/kubectl-iscale"
brew "datadog/tap/kubectl-multiexec"
brew "datadog/tap/kubectl-template"
cask "datadog/tap/ddtool"
brew "unison" # nbt dependency
brew "datadog/tap/agenda"
cask "datadog/tap/datadog-workspaces"
brew "datadog/tap/devkube"
brew "datadog/tap/docker-local-dev"
brew "datadog/tap/latest-artifact"
brew "datadog/tap/latest-datacenter-config"
brew "datadog/tap/sce"
brew "datadog/tap/trigger-ci"
cask "bzl"
cask "ddr"

# temporal cli
brew "tctl"
cask "tctl-local-auth"
cask "tctl-data-converter"
cask "tctx"
cask "tilt"
cask "tilt-functions"

# scala/mortar
tap "homebrew/cask-versions"
cask "homebrew/cask-versions/adoptopenjdk8"
# brew "scala211"
# brew "sbt"

# tap "datadog/data-eng-tools", "git@github.com:DataDog/data-eng-tools.git"
# brew "data-eng-tools"

brew "mysql"
# brew "postgresql@9.6"
brew "openssl"

brew "gnupg"
brew "make"
brew "pre-commit"
brew "bazelisk"

brew "tfenv"
brew "awscli@1"
brew "azure-cli"
brew "vault"
cask "google-cloud-sdk"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "stern"
brew "rbenv"
brew "black"
cask "aws-vault"

# agenda
brew "just"

# web-ui
brew "yarn"
brew "nodenv"

# dogbox
# cask "virtualbox"
# cask "vagrant"

brew "saml2aws"
