# coreutils
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "watch"
brew "findutils"

# shells
brew "bash"
brew "zsh"

# search
brew "ripgrep"
brew "the_silver_searcher"

# compression
brew "gzip"
brew "unzip"
brew "unrar"
brew "lz4"

# git
brew "git"
brew "tig"

# curl or similar
brew "curl"
brew "wget"

# emacs
tap "railwaycat/emacsmacport"
brew "railwaycat/emacsmacport/emacs-mac"
brew "imagemagick" # required by emacs

# ledger
brew "ledger"
brew "hledger"

# python
brew "python"
brew "openblas" # https://github.com/numpy/numpy/issues/17784#issuecomment-729950525
brew "pyenv"
brew "pyenv-virtualenv"
brew "zlib" # pyenv dependency
brew "pipenv"

brew "stow"
brew "tmux"
brew "fzf"
brew "jq"
brew "neovim"
brew "htop"
brew "ncdu"
brew "go"
brew "gimme"
brew "node"
brew "npm"
brew "rustup"
brew "java"
brew "loc"
brew "cmatrix"
brew "pandoc"
brew "tldr"
brew "sshuttle"
brew "qcachegrind"
brew "tree"
brew "geckodriver"
brew "youtube-dl"
brew "ffmpeg"
brew "exiftool"

tap "homebrew/cask"
cask "google-chrome"
cask "firefox"
cask "tor-browser"
cask "iterm2"
cask "spotify"
cask "visual-studio-code"
cask "calibre"
cask "bitwarden"
cask "telegram"
cask "whatsapp"
cask "evernote"
cask "libreoffice"
cask "typora"
cask "vlc"
cask "mactex"
cask "dash"
cask "karabiner-elements"
cask "transmission"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "musicbrainz-picard"
cask "drawio"
cask "istat-menus"
cask "postman"
cask "monitorcontrol"
cask "netnewswire"
cask "virtualbox"

tap "homebrew/cask-versions"

tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-cascadia"

tap "homebrew/cask-drivers"
cask "logitech-options"

tap "heroku/brew"
brew "heroku"
brew "heroku-node"  # heroku dependency, not properly resolved by brew bundle
